Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
r apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + region                        = "ap-southeast-3"
      + starting_position             = "LATEST"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + tags_all                      = (known after apply)
      + uuid                          = (known after apply)

      + amazon_managed_kafka_event_source_config (known after apply)

      + filter_criteria {
          + filter {
              + pattern = jsonencode(
                    {
                      + eventName = [
                          + "MODIFY",
                        ]
                    }
                )
            }
        }

      + self_managed_kafka_event_source_config (known after apply)
    }

  # module.svep[0].aws_lambda_function_recursion_config.concat_starter_recursion will be created
  + resource "aws_lambda_function_recursion_config" "concat_starter_recursion" {
      + function_name  = "svep-backend-concatStarter"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_function_recursion_config.create_pages_recursion will be created
  + resource "aws_lambda_function_recursion_config" "create_pages_recursion" {
      + function_name  = "svep-backend-createPages"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_function_recursion_config.init_query_recursion will be created
  + resource "aws_lambda_function_recursion_config" "init_query_recursion" {
      + function_name  = "svep-backend-initQuery"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_function_recursion_config.plugin_consequence_recursion will be created
  + resource "aws_lambda_function_recursion_config" "plugin_consequence_recursion" {
      + function_name  = "svep-backend-pluginConsequence"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_function_recursion_config.query_gtf_recursion will be created
  + resource "aws_lambda_function_recursion_config" "query_gtf_recursion" {
      + function_name  = "svep-backend-queryGTF"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_function_recursion_config.query_vcf_recursion will be created
  + resource "aws_lambda_function_recursion_config" "query_vcf_recursion" {
      + function_name  = "svep-backend-queryVCF"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_function_recursion_config.update_reference_files_recursion will be created
  + resource "aws_lambda_function_recursion_config" "update_reference_files_recursion" {
      + function_name  = "svep-backend-updateReferenceFiles"
      + recursive_loop = "Allow"
      + region         = "ap-southeast-3"
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer will be created
  + resource "aws_lambda_layer_version" "binaries_layer" {
      + arn                         = (known after apply)
      + code_sha256                 = (known after apply)
      + compatible_runtimes         = [
          + "python3.12",
        ]
      + created_date                = (known after apply)
      + filename                    = "svep/binaries.zip"
      + id                          = (known after apply)
      + layer_arn                   = (known after apply)
      + layer_name                  = "svep_backend_binaries_layer"
      + region                      = "ap-southeast-3"
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      + skip_destroy                = false
      + source_code_hash            = (known after apply)
      + source_code_size            = (known after apply)
      + version                     = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.batch_submit_invoke_permission will be created
  + resource "aws_lambda_permission" "batch_submit_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-batchSubmit"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "APIBatchSubmitAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.clearTempAndRegions_invoke_permission will be created
  + resource "aws_lambda_permission" "clearTempAndRegions_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-clearTempAndRegions"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSclearTempAndRegionsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_batch_starter_invoke_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_batch_starter_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-batchStarter"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchBatchStarterAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_delete_clinical_workflow_invoke_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_delete_clinical_workflow_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-deleteClinicalWorkflow"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchDeleteClinicalWorkflowAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_svep_reference_update_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_svep_reference_update_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchSvepReferenceUpdateAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_update_reference_files_invoke_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_update_reference_files_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchUpdateReferenceFilesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concat"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSConcatAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_pages_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_pages_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concatPages"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSConcatPagesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.concat_starter_invoke_permission will be created
  + resource "aws_lambda_permission" "concat_starter_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-concatStarter"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSConcatStarterAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.create_pages_invoke_permission will be created
  + resource "aws_lambda_permission" "create_pages_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-createPages"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSCreatePagesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.formatOutput_invoke_permission will be created
  + resource "aws_lambda_permission" "formatOutput_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-formatOutput"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSformatOutputAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.get_results_invoke_permission will be created
  + resource "aws_lambda_permission" "get_results_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-getResultsURL"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "APIGetResultsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.init_query_invoke_permission will be created
  + resource "aws_lambda_permission" "init_query_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-initQuery"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "APIInitQueryAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.initquery_invoke_permission_sns will be created
  + resource "aws_lambda_permission" "initquery_invoke_permission_sns" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-initQuery"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSInitQueryAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_clinvar_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_clinvar_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginClinvar"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginClinvarAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_consequence_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_consequence_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginConsequence"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginConsequenceAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_constraint_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_constraint_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomadConstraint"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomad"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_one_kg_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_one_kg_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomadOneKG"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_send_job_email_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_send_job_email_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-sendJobEmail"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSSendJobEmailAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.qcNotes_invoke_permission will be created
  + resource "aws_lambda_permission" "qcNotes_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-qcNotes"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SvepAPIQcNotesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_gtf_invoke_permission will be created
  + resource "aws_lambda_permission" "query_gtf_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryGTF"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSQueryGTFAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_vcf_invoke_permission will be created
  + resource "aws_lambda_permission" "query_vcf_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryVCF"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSQueryVCFAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.query_vcf_submit_invoke_permission will be created
  + resource "aws_lambda_permission" "query_vcf_submit_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-queryVCFsubmit"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSQueryVCFSubmitAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.sns_update_reference_files_invoke_permission will be created
  + resource "aws_lambda_permission" "sns_update_reference_files_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-updateReferenceFiles"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "SNSUpdateReferenceFilesAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.vcfstats_graphic_invoke_permission will be created
  + resource "aws_lambda_permission" "vcfstats_graphic_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-qcFigures"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "ap-southeast-3"
      + source_arn          = (known after apply)
      + statement_id        = "APIVcfstatsAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_s3_bucket.lambda-layers-bucket will be created
  + resource "aws_s3_bucket" "lambda-layers-bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-layers-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-references will be created
  + resource "aws_s3_bucket" "svep-references" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-references-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-regions will be created
  + resource "aws_s3_bucket" "svep-regions" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-regions-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-results will be created
  + resource "aws_s3_bucket" "svep-results" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-results-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket.svep-temp will be created
  + resource "aws_s3_bucket" "svep-temp" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = (known after apply)
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = "svep-backend-temp-"
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = true
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                    = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # module.svep[0].aws_s3_bucket_cors_configuration.svep-results-cors will be created
  + resource "aws_s3_bucket_cors_configuration" "svep-results-cors" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "GET",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = []
            id              = null
          + max_age_seconds = 3000
        }
    }

  # module.svep[0].aws_s3_bucket_lifecycle_configuration.svep-temp-lifecycle will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "svep-temp-lifecycle" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ap-southeast-3"
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "remove-old-payloads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + expiration {
              + days                         = 1
              + expired_object_delete_marker = false
            }

          + filter {
              + prefix = "payloads/"
            }
        }
    }

  # module.svep[0].aws_s3_bucket_versioning.svep-references will be created
  + resource "aws_s3_bucket_versioning" "svep-references" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-southeast-3"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # module.svep[0].aws_sns_topic.clearTempAndRegions will be created
  + resource "aws_sns_topic" "clearTempAndRegions" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-clearTempAndRegions"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.concat will be created
  + resource "aws_sns_topic" "concat" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-concat"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.concatPages will be created
  + resource "aws_sns_topic" "concatPages" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-concatPages"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.concatStarter will be created
  + resource "aws_sns_topic" "concatStarter" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-concatStarter"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.createPages will be created
  + resource "aws_sns_topic" "createPages" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-createPages"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.formatOutput will be created
  + resource "aws_sns_topic" "formatOutput" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-formatOutput"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.initQuery will be created
  + resource "aws_sns_topic" "initQuery" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-initQuery"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginClinvar will be created
  + resource "aws_sns_topic" "pluginClinvar" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginClinvar"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginConsequence will be created
  + resource "aws_sns_topic" "pluginConsequence" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginConsequence"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomad will be created
  + resource "aws_sns_topic" "pluginGnomad" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomad"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadConstraint will be created
  + resource "aws_sns_topic" "pluginGnomadConstraint" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomadConstraint"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadOneKG will be created
  + resource "aws_sns_topic" "pluginGnomadOneKG" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomadOneKG"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.queryGTF will be created
  + resource "aws_sns_topic" "queryGTF" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-queryGTF"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.queryVCF will be created
  + resource "aws_sns_topic" "queryVCF" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-queryVCF"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.queryVCFsubmit will be created
  + resource "aws_sns_topic" "queryVCFsubmit" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-queryVCFsubmit"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.sendJobEmail will be created
  + resource "aws_sns_topic" "sendJobEmail" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-sendJobEmail"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.updateReferenceFiles will be created
  + resource "aws_sns_topic" "updateReferenceFiles" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-updateReferenceFiles"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-southeast-3"
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.clearTempAndRegions will be created
  + resource "aws_sns_topic_subscription" "clearTempAndRegions" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.concat will be created
  + resource "aws_sns_topic_subscription" "concat" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.concatPages will be created
  + resource "aws_sns_topic_subscription" "concatPages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.concatStarter will be created
  + resource "aws_sns_topic_subscription" "concatStarter" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.createPages will be created
  + resource "aws_sns_topic_subscription" "createPages" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.formatOutput will be created
  + resource "aws_sns_topic_subscription" "formatOutput" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.initQuery will be created
  + resource "aws_sns_topic_subscription" "initQuery" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginClinvar will be created
  + resource "aws_sns_topic_subscription" "pluginClinvar" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginConsequence will be created
  + resource "aws_sns_topic_subscription" "pluginConsequence" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomad will be created
  + resource "aws_sns_topic_subscription" "pluginGnomad" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadConstraint will be created
  + resource "aws_sns_topic_subscription" "pluginGnomadConstraint" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadOneKG will be created
  + resource "aws_sns_topic_subscription" "pluginGnomadOneKG" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.queryGTF will be created
  + resource "aws_sns_topic_subscription" "queryGTF" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.queryVCF will be created
  + resource "aws_sns_topic_subscription" "queryVCF" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.queryVCFsubmit will be created
  + resource "aws_sns_topic_subscription" "queryVCFsubmit" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.sendJobEmail will be created
  + resource "aws_sns_topic_subscription" "sendJobEmail" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.updateReferenceFiles will be created
  + resource "aws_sns_topic_subscription" "updateReferenceFiles" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + region                          = "ap-southeast-3"
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sqs_queue.batch_submit_qld will be created
  + resource "aws_sqs_queue" "batch_submit_qld" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "svep-backend-batchSubmitDLQ"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 0
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ap-southeast-3"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 30
    }

  # module.svep[0].aws_sqs_queue.batch_submit_queue will be created
  + resource "aws_sqs_queue" "batch_submit_queue" {
      + arn                               = (known after apply)
      + content_based_deduplication       = false
      + deduplication_scope               = (known after apply)
      + delay_seconds                     = 0
      + fifo_queue                        = false
      + fifo_throughput_limit             = (known after apply)
      + id                                = (known after apply)
      + kms_data_key_reuse_period_seconds = (known after apply)
      + max_message_size                  = 262144
      + message_retention_seconds         = 1209600
      + name                              = "svep-backend-batchSubmitQueue"
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      + receive_wait_time_seconds         = 20
      + redrive_allow_policy              = (known after apply)
      + redrive_policy                    = (known after apply)
      + region                            = "ap-southeast-3"
      + sqs_managed_sse_enabled           = (known after apply)
      + tags                              = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + tags_all                          = {
          + "Environment" = "STAGING"
          + "NAME"        = "svep-backend"
          + "Owner"       = "GXC"
        }
      + url                               = (known after apply)
      + visibility_timeout_seconds        = 300
    }

  # module.svep[0].null_resource.init_script will be created
  + resource "null_resource" "init_script" {
      + id       = (known after apply)
      + triggers = {
          + "script_hash" = "01e727bcc92faebfec86a58bf89ce955a0845b92"
        }
    }

  # module.webgui.data.external.build will be read during apply
  # (config refers to values not yet known)
 <= data "external" "build" {
      + id          = (known after apply)
      + program     = [
          + "python",
          + "build_and_hash.py",
        ]
      + query       = {
          + "api_endpoint_clinic"     = (known after apply)
          + "api_endpoint_sb
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.